nrfconnect/sdk-zephyr/soc/nordic/nrf71/soc.c
/*
 * Copyright (c) 2025 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @brief System/hardware module for Nordic Semiconductor nRF71 family processor
 *
 * This module provides routines to initialize and support board-level hardware
 * for the Nordic Semiconductor nRF71 family processor.
 */

#include <zephyr/autoconf.h>

#include <zephyr/kernel.h>
#include <zephyr/devicetree.h>
#include <zephyr/init.h>
#include <zephyr/logging/log.h>
#include <zephyr/cache.h>
#ifndef __ZEPHYR__
#include <hal/nrf_cache.h>
#endif

#if defined(NRF_APPLICATION)
#include <cmsis_core.h>
#include <hal/nrf_glitchdet.h>
#endif

#include <soc.h>
#include <nrfx.h>
#include <helpers/nrfx_ram_ctrl.h>
#include <lib/nrfx_coredep.h>

#include <hal/nrf_spu.h>
#include <hal/nrf_mpc.h>
#include <hal/nrf_lfxo.h>
#include <hal/nrf_gpio.h>

#include <approtect_setup.h>
#include <wicr_setup.h>

LOG_MODULE_REGISTER(soc, CONFIG_SOC_LOG_LEVEL);

#define LFXO_NODE DT_NODELABEL(lfxo)

#define NRF7120_FICR_SOCINFO_HWREVISION_OFFSET 0x344U
#define NRF7120_HWREVISION_1_0                  0x0U

#if !defined(CONFIG_TRUSTED_EXECUTION_NONSECURE)

struct mpc_region_override {
	nrf_mpc_override_config_t config;
	uintptr_t startaddr;
	uintptr_t endaddr;
	uint32_t perm;
	uint32_t permmask;
};

/*
 * Initialize the override struct with reasonable defaults. This includes:
 *
 * Use a slave number of 0 to avoid redirecting bus transactions from
 * one slave to another.
 *
 * Lock the override to prevent the code that follows from tampering
 * with the configuration.
 *
 * Enable the override so it takes effect.
 *
 * Indicate that secdom is not enabled as this driver is not used on
 * platforms with secdom.
 */
#define MPC_REGION_OVERRIDE_INIT(_startaddr, _endaddr, _secure, _privileged)			\
	{											\
		.config =  {									\
			.slave_number = 0,							\
			.lock = true,								\
			.enable = true,								\
			.secdom_enable = false,							\
			.secure_mask = false,							\
		},										\
		.startaddr = _startaddr,							\
		.endaddr = _endaddr,								\
		.perm = (									\
			(MPC_OVERRIDE_PERM_READ_Allowed << MPC_OVERRIDE_PERM_READ_Pos) |	\
			(MPC_OVERRIDE_PERM_WRITE_Allowed << MPC_OVERRIDE_PERM_WRITE_Pos) |	\
			(MPC_OVERRIDE_PERM_EXECUTE_Allowed << MPC_OVERRIDE_PERM_EXECUTE_Pos) |	\
			(_secure << MPC_OVERRIDE_PERM_SECATTR_Pos) |				\
			(_privileged << MPC_OVERRIDE_PERM_PRIVL_Pos)				\
		),										\
		.permmask = (									\
			MPC_OVERRIDE_PERM_READ_Msk |						\
			MPC_OVERRIDE_PERM_WRITE_Msk |						\
			MPC_OVERRIDE_PERM_EXECUTE_Msk |						\
			MPC_OVERRIDE_PERM_SECATTR_Msk |						\
			MPC_OVERRIDE_PERM_PRIVL_Msk						\
		),										\
	}

static const struct mpc_region_override mpc00_region_overrides[] = {
	/* Make RAM_00/01/02/03 (AMBIX00 + AMBIX03) accessible to all domains */
	MPC_REGION_OVERRIDE_INIT(0x20000000, 0x200FE000, 0, 0),
	/* Make MRAM accessible to all domains */
	MPC_REGION_OVERRIDE_INIT(0x00000000, 0x01000000, 0, 0),
#if CONFIG_SOC_NRF71_WIFI_DAP
	/* Allow access to Wi-Fi debug interface registers */
	MPC_REGION_OVERRIDE_INIT(0x48000000, 0x48100000, 0, 0),
#endif
};

static const struct mpc_region_override mpc03_region_overrides[] = {
	/* Make RAM_02/03 (AMBIX03)  accessible to all domains */
	MPC_REGION_OVERRIDE_INIT(0x200C0000, 0x200FE000, 0, 0),
};

static void set_mpc_region_override(NRF_MPC_Type *mpc,
				    size_t index,
				    const struct mpc_region_override *override)
{
	nrf_mpc_override_startaddr_set(mpc, index, override->startaddr);
	nrf_mpc_override_endaddr_set(mpc, index, override->endaddr);
	nrf_mpc_override_perm_set(mpc, index, override->perm);
	nrf_mpc_override_permmask_set(mpc, index, override->permmask);
	nrf_mpc_override_config_set(mpc, index, &override->config);
}

static void mpc_configuration(void)
{
	ARRAY_FOR_EACH(mpc00_region_overrides, i) {
		set_mpc_region_override(NRF_MPC00, i, &mpc00_region_overrides[i]);
	}

	ARRAY_FOR_EACH(mpc03_region_overrides, i) {
		set_mpc_region_override(NRF_MPC03, i, &mpc03_region_overrides[i]);
	}
}

/**
 * Return the SPU instance that can be used to configure the
 * peripheral at the given base address.
 */
static inline NRF_SPU_Type *spu_instance_from_peripheral_addr(uint32_t peripheral_addr)
{
	/* See the SPU chapter in the IPS for how this is calculated */

	uint32_t apb_bus_number = peripheral_addr & 0x00FC0000;

	return (NRF_SPU_Type *)(0x50000000 | apb_bus_number);
}

static void oscillators_configuration(void)
{
	NRF_SPU_Type *spu_instance =
		spu_instance_from_peripheral_addr(NRF_OSCILLATORS_S_BASE);
	uint8_t periph_id = NRFX_PERIPHERAL_ID_GET(NRF_OSCILLATORS_S_BASE);
	uint8_t spu_id = NRFX_PERIPHERAL_ID_GET(spu_instance);
	uint8_t index = periph_id - spu_id;
	uint32_t hw_revision = *(volatile const uint32_t *)
		(NRF_FICR_NS_BASE + NRF7120_FICR_SOCINFO_HWREVISION_OFFSET);
	bool secure = hw_revision != NRF7120_HWREVISION_1_0;

	/*
	 * On nRF7120 1.0, Wi-Fi is non-secure and configures the PLL in
	 * NRF_OSCILLATORS. Keep the peripheral secure on all other revisions.
	 *
	 * NRF_OSCILLATORS and NRF_REGULATORS share a peripheral ID and must
	 * therefore have the same security configuration.
	 */
	nrf_spu_periph_perm_secattr_set(spu_instance, index, secure);
	nrf_spu_periph_perm_lock_enable(spu_instance, index);
}

static void grtc_configuration(void)
{
	/* Split security configuration to let Wi-Fi access GRTC */
	nrf_spu_feature_secattr_set(NRF_SPU20, NRF_SPU_FEATURE_GRTC_CC, 15, 0, 0);
	nrf_spu_feature_secattr_set(NRF_SPU20, NRF_SPU_FEATURE_GRTC_CC, 14, 0, 0);
	nrf_spu_feature_secattr_set(NRF_SPU20, NRF_SPU_FEATURE_GRTC_INTERRUPT, 4, 0, 0);
	nrf_spu_feature_secattr_set(NRF_SPU20, NRF_SPU_FEATURE_GRTC_INTERRUPT, 5, 0, 0);
	nrf_spu_feature_secattr_set(NRF_SPU20, NRF_SPU_FEATURE_GRTC_SYSCOUNTER, 0, 0, 0);
}

static void ipct_configuration(void)
{
	/* Grant secure access to IPCT, since NS by default */
	nrf_spu_periph_perm_secattr_set(NRF_SPU10, 13, true);
}
#endif /* CONFIG_TRUSTED_EXECUTION_NONSECURE */

#if defined(CONFIG_SOC_NRF71_WIFI_BOOT)
/*
 * These helpers poke the Wi-Fi core and CLOCK registers, so they only exist in the domain that
 * owns that setup: the Zephyr secure/application image, or the non-Zephyr (TF-M) build. Guarding
 * the definitions with the same condition as the call site keeps the non-secure Zephyr build from
 * compiling them unused.
 */
#if (defined(NRF_APPLICATION) && !defined(CONFIG_TRUSTED_EXECUTION_NONSECURE)) || \
	!defined(__ZEPHYR__)

#if DT_HAS_COMPAT_STATUS_OKAY(nordic_nrf71_wifi_antsw)
#define WIFI_ANTSW_NODE DT_COMPAT_GET_ANY_STATUS_OKAY(nordic_nrf71_wifi_antsw)

/* Steering an unpowered switch is meaningless: require pwr_antswc to power it. */
BUILD_ASSERT(DT_HAS_COMPAT_STATUS_OKAY(nordic_nrf_pwr_antswc),
	     "wifi-antsw steering requires pwr_antswc to power the antenna switch");

/*
 * Steer the antenna switch (ANTSW) towards WLAN before the Wi-Fi core is
 * started. This runs before the GPIO driver is up, so the pin (described in
 * devicetree) is configured directly through the nrf_gpio HAL, which keeps the
 * access on the P0 alias that matches the build's security state. Powering the
 * switch is handled separately by pwr_antswc.
 */
static void antsw_setup(void)
{
	uint32_t wlan_psel = NRF_DT_GPIOS_TO_PSEL(WIFI_ANTSW_NODE, wlan_gpios);

	/* Drive the pin low (WLAN) before enabling the output, then configure it
	 * as a plain output. No pull is needed on a driven output.
	 */
	nrf_gpio_pin_clear(wlan_psel);
	nrf_gpio_cfg_output(wlan_psel);
}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(nordic_nrf71_wifi_antsw) */

/*
 * CLOCK is a split-security peripheral, so the XOSTART task and XOSTARTED event must be reached
 * through the alias matching the domain that owns CLOCK when this code runs. The Zephyr secure
 * image drives it through the _S alias, while the non-Zephyr (TF-M) build runs after CLOCK has
 * been handed to the non-secure domain and must use the _NS alias to avoid a secure bus fault.
 */
#if defined(__ZEPHYR__)
#define NRF_CLOCK_REG NRF_CLOCK_S
#else
#define NRF_CLOCK_REG NRF_CLOCK_NS
#endif

/* Generous bound versus the ~450 us the crystal typically needs to reach Running. */
#define HFXO64M_START_TIMEOUT_US 10000U

/*
 * The boot ROM configures HFXO64M (trims, mirror, auto power) but does not start it, so kick
 * the CLOCK XOSTART task and wait until the crystal is running. XO.STAT.STATE is the barrier
 * the Wi-Fi core depends on: releasing the core before it reads Running brings it up against
 * an unsettled clock, which shows up as intermittent, poor Wi-Fi performance.
 */
static int hfxo64m_start(void)
{
	NRF_CLOCK_REG->EVENTS_XOSTARTED = 0;
	NRF_CLOCK_REG->TASKS_XOSTART =
		(CLOCK_TASKS_XOSTART_TASKS_XOSTART_Trigger << CLOCK_TASKS_XOSTART_TASKS_XOSTART_Pos);

	/* Runs before the kernel, so bound the wait with the coredep busy-wait, not kernel timing. */
	for (uint32_t elapsed_us = 0U; elapsed_us < HFXO64M_START_TIMEOUT_US; elapsed_us++) {
		if ((NRF_CLOCK_REG->XO.STAT & CLOCK_XO_STAT_STATE_Msk) ==
		    (CLOCK_XO_STAT_STATE_Running << CLOCK_XO_STAT_STATE_Pos)) {
			return 0;
		}
		nrfx_coredep_delay_us(1);
	}

	LOG_ERR("HFXO64M did not start within %u us", HFXO64M_START_TIMEOUT_US);
	return -ETIMEDOUT;
}

static void wifi_setup(void)
{
	/* Kickstart the LMAC processor */
	NRF_WIFICORE_LRCCONF_LRC0->POWERON =
		(LRCCONF_POWERON_MAIN_AlwaysOn << LRCCONF_POWERON_MAIN_Pos);
	NRF_WIFICORE_LMAC_VPR->INITPC = (uint32_t)(uintptr_t)NRF_WICR->FIRMWARE.LMACINITPC;
	NRF_WIFICORE_LMAC_VPR->CPURUN = (VPR_CPURUN_EN_Running << VPR_CPURUN_EN_Pos);
}
#endif /* (NRF_APPLICATION && !CONFIG_TRUSTED_EXECUTION_NONSECURE) || !__ZEPHYR__ */
#endif /* CONFIG_SOC_NRF71_WIFI_BOOT */

/**
 * This function is used by TF-M (see target_cfg_71.c, nrf71_init.c). You must align the TF-M
 * implementation if you want to change this function.
 */
int nordicsemi_nrf71_init(void)
{
#if defined(CONFIG_HAS_NORDIC_RAM_CTRL) && !defined(CONFIG_TRUSTED_EXECUTION_NONSECURE)
	nrfx_ram_ctrl_retention_enable_all_set(false);
#endif

	/* Update the SystemCoreClock global variable with current core clock
	 * retrieved from the DT.
	 */
	SystemCoreClock = NRF_PERIPH_GET_FREQUENCY(DT_NODELABEL(cpu));

#if !defined(CONFIG_TRUSTED_EXECUTION_NONSECURE)
	/* Skip for tf-m, configuration exist in target_cfg_71.c */
	oscillators_configuration();
	mpc_configuration();
	grtc_configuration();
	ipct_configuration();
#endif

#if (defined(NRF_APPLICATION) && !defined(CONFIG_TRUSTED_EXECUTION_NONSECURE)) || \
	!defined(__ZEPHYR__)
#if defined(CONFIG_SOC_NRF7120_APPROTECT_BOOT_WORKAROUND)
	approtect_setup();
#endif

#if defined(CONFIG_SOC_NRF7120_WICR_SETUP)
	int ret = wicr_setup();

	if (ret != 0) {
		LOG_ERR("WICR programming failed: %d", ret);
		return ret;
	}
#endif

#if defined(CONFIG_SOC_NRF71_WIFI_BOOT)
#if DT_HAS_COMPAT_STATUS_OKAY(nordic_nrf_pwr_antswc)
	/* Power on the antenna switch before starting the Wi-Fi core. */
	*(volatile uint32_t *)PWR_ANTSWC_REG |= PWR_ANTSWC_ENABLE;
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(nordic_nrf71_wifi_antsw)
	/* Steer the (now powered) antenna switch towards WLAN before Wi-Fi boot. */
	antsw_setup();
#endif
	/* Start the 64 MHz crystal and wait for it before releasing the Wi-Fi core. */
	int err = hfxo64m_start();

	if (err != 0) {
		return err;
	}

	wifi_setup();
#endif /* CONFIG_SOC_NRF71_WIFI_BOOT */
#endif /* (NRF_APPLICATION && !CONFIG_TRUSTED_EXECUTION_NONSECURE) || !__ZEPHYR__ */

	/* Configure LFXO capacitive load if internal load capacitors are used */
#if DT_ENUM_HAS_VALUE(LFXO_NODE, load_capacitors, internal)
	nrf_lfxo_cload_set(NRF_LFXO,
			(uint8_t)(DT_PROP(LFXO_NODE, load_capacitance_femtofarad) / 1000));
#endif

#ifdef __ZEPHYR__
	sys_cache_instr_enable();
#elif defined(NRF_ICACHE)
	nrf_cache_enable(NRF_ICACHE);
#endif
	return 0;
}

void soc_early_init_hook(void)
{
	(void)nordicsemi_nrf71_init();
}

void arch_busy_wait(uint32_t time_us)
{
	nrfx_coredep_delay_us(time_us);
}

#ifdef CONFIG_SOC_RESET_HOOK
void soc_reset_hook(void)
{
	SystemInit();
}
#endif
